# Public Brewfile — portable CLI tooling.
# Apply: brew bundle --file=Brewfile

# core
brew "actionlint"
brew "ansiweather"
brew "automake"
brew "bash_unit"
brew "bindgen"
brew "cmake"
brew "coreutils"
brew "dict"
brew "emacs"
brew "fd"
brew "gawk"
brew "gh"
brew "gnu-getopt"
brew "gnu-sed"
brew "graphviz"
brew "hadolint"
brew "just"
brew "leiningen"
brew "libffi"
brew "llvm"
brew "lynx"
brew "make"
brew "mdless"
brew "mermaid-cli"
brew "nvm"
brew "openjdk@21"
brew "pandoc"
brew "pinentry-mac"
brew "poppler"
brew "postgresql@15"
brew "python@3.13"
brew "python@3.14"
brew "ripgrep"
brew "rustup"
brew "sevenzip"
brew "speedtest-cli"
brew "tree"
brew "typst"
brew "uv"
brew "vim"
brew "virtualenv"
brew "wget"
brew "zlib"

# AI / local models
brew "gemini-cli"
brew "llama.cpp"
brew "ollama"

# casks
cask "alfred"
cask "copilot-cli"
cask "docker-desktop"
cask "gcloud-cli"
cask "gpg-suite"
cask "iterm2"
cask "mactex"
